backend/advanced/backend/views/users/index.php

SELECT `menuname` FROM `menus`
---
                    <li><a href="<?= Yii::$app->request->baseUrl; ?>/site/"><i class="sl sl-icon-settings"></i>
                              <?php

$rows = (new \yii\db\Query())
->select(['menuname'])
->from('menus')
->all();