backend/advanced/backend/views/venues/index.php

                    <li><a href="<?= Yii::$app->request->baseUrl; ?>/site/"><i class="sl sl-icon-settings"></i>
                              <?php

$rows = (new \yii\db\Query())
->select(['menuname'])
->from('menus')
->all();
---
SELECT `menuname` FROM `menus`