backend/advanced/backend/controllers/MoviesController.php

INSERT INTO `movies` (`ticket_id`, `artist_id`, `category_id`, `language_id`, `location_id`, `mv_pic`, `mv_category`, `mv_name`, `mv_art_name`, `mv_ticket`, `mv_language`, `mv_location`, `is_active`, `create_at`, `update_at`) VALUES (1, 3, 3, 3, 3, '', 'Action', 'ABC', 'asas', '300', 'Hindi', 'kjnklj', 'Active', NULL, NULL)
---
    public function actionCreate()
    {
        $model = new Movies();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `movies` WHERE `id`='6'
---
    protected function findModel($id)
    {
        if (($model = Movies::findOne($id)) !== null) {