backend/advanced/common/models/User.php

SELECT * FROM `user` WHERE `id`=8
---
    public static function findIdentity($id) {
        return self::findOne($id);

SELECT * FROM `user` WHERE `username`='maya.gajjar'
---
    public static function findByUsername($username){
        return self::findOne(['username'=>$username]);